In [2]:
import pandas as pd
df = pd.read_csv(r"C:\\Users\Natan\\OneDrive\\Documents\\Victor-projects\\projetos_python\\Data_analysis\\salaries-mls\\2014\\mls-salaries-2014.csv")
df

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,DAL,Acosta,Kellyn,M,55000.0,79000.00
1,VAN,Adekugbe,Samuel,D,50000.0,55000.00
2,POR,Adi,Fanendo,F,580800.0,593300.00
3,COL,Agbossoumonde,Gale,D,48825.0,55491.67
4,DAL,Akindele,Tesho,F,48500.0,48500.00
...,...,...,...,...,...,...
567,POR,Zemanski,Ben,M,80850.0,83350.00
568,DAL,Zendejas,Alejandro,F,36504.0,53170.67
569,DAL,Zimmerman,Walker,D,80000.0,160100.00
570,KC,Zizzo,Sal,F,77000.0,91045.71
571,KC,Zusi,Graham,F-M,600000.0,631388.89

In [2]:
df['full_name'] = df['first_name'] + ' ' + df['last_name'] + ' ' + df['club']
df_agrupado = df.groupby('full_name', as_index=False)['base_salary'].max()
df_agrupado = df_agrupado.sort_values(by='base_salary', ascending=False)
df_agrupado

                full_name  base_salary
401   Michael Bradley TOR    6000000.0
271     Jermain Defoe TOR    6000000.0
124     Clint Dempsey SEA    4913004.0
466       Robbie Keane LA    4500000.0
340     Landon Donovan LA    4250000.0
..                    ...          ...
132     Conor Shanosky DC      36500.0
359       Luis Soffner NE      36500.0
73   Bradford Jamieson LA      36500.0
474        Ruben Bover NY      36500.0
424       Nick Walker DAL      36500.0

[565 rows x 2 columns]

In [3]:
df_agrupado = df.groupby('position')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

position
F-M    382500.000000
F      323691.992836
M      228262.309834
D/M    215000.000000
M-F    200143.428571
D-M    177800.000000
D/F    140000.000000
M/F    138750.000000
D      129345.806747
M-D    117765.000000
GK      92487.574426
M/D     75441.666667
MF      57750.000000
F/M     51150.000000
Name: base_salary, dtype: float64

In [3]:
df_agrupado = df.groupby('club')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

club
ORL      1.371000e+06
TOR      5.409182e+05
LA       4.125158e+05
NY       3.667432e+05
SEA      3.132211e+05
NE       2.052559e+05
POR      1.821975e+05
MTL      1.587786e+05
VAN      1.566458e+05
HOU      1.548988e+05
KC       1.428728e+05
SJ       1.364509e+05
PHI      1.357700e+05
DAL      1.303560e+05
RSL      1.302684e+05
CHI      1.217154e+05
DC       1.157249e+05
CHV      1.061183e+05
CLB      1.058787e+05
COL      1.037083e+05
NYCFC    9.170080e+04
POOL     3.650400e+04
Name: base_salary, dtype: float64

In [5]:
df['base_salary'].mean()

204007.70118881122

In [4]:
df_filtered = df[df['base_salary'] < 1500000]
df_filtered['base_salary'].mean()

126558.64720142602